app/controllers/api/authentication_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'example@mail.com' LIMIT 1
UPDATE `users` SET `remember_token` = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjo0LCJleHAiOjE0OTY4NjE2NjF9.j3u0BPCNeJW6Ap-32aV15IcHx3q5X2HdjkG5e5jdRlU', `updated_at` = '2017-06-06 18:54:21' WHERE `users`.`id` = 4
---
    def authenticate
      command = AuthenticateUser.call(params[:email], params[:password])

      if command.success?
        user = User.find_by_email(params[:email])
        user.update(remember_token: command.result)