app/controllers/api/bucket_controller.rb

SELECT `buckets`.* FROM `buckets` WHERE `buckets`.`user` = 4
SELECT `albums`.* FROM `albums`
---
    def widget
      @taglist = ActsAsTaggableOn::Tag.all
      @bucket = Bucket.where(user: @current_user.id)
      @albums = Album.all