app/controllers/api/photos_controller.rb

    def show
      if params.has_key?(:size)
        @size = params[:size]
      else
        @size = 'medium'
      end
      @photo = Photo.find(params[:id])
      @bucket = session[:bucket]
      @albums = Album.all
---
SELECT  `photos`.* FROM `photos` WHERE `photos`.`id` = 76 LIMIT 1
SELECT `albums`.* FROM `albums`

    def rotate
      @photo = Photo.find(params[:id]).id
---
SELECT  `photos`.* FROM `photos` WHERE `photos`.`id` = 73 LIMIT 1