app/controllers/api/photofiles_controller.rb

SELECT  `photofiles`.* FROM `photofiles` WHERE `photofiles`.`id` = 434 LIMIT 1
---
    def photoserve
      begin
        @photo = Photofile.find(params[:id])